[
    
    "The Friday prayer in congregation is a necessary duty for every Muslim, with four exceptions, a slave, a woman, a boy, and a sick person.",
    "O mankind, fear your Lord, who created you from one soul and created from it its mate and dispersed from both of them many men and women.",
    "And give the women upon marriage their bridal gifts graciously.",
    "O you who have believed, it is not lawful for you to inherit women by compulsion.",
    "And do not make difficulties for them in order to take [back] part of what you gave them unless they commit a clear immorality.",
    
    "It is harmful you shall avoid sexual intercourse with the women during menstruation; do not approach them until they are rid of it. Once they are rid of it, you may have intercourse with them in the manner designed by God. God loves the repenters, and He loves those who are clean.",
    "Your women are the bearers of your seed. Thus, you may enjoy this privilege however you like, so long as you maintain righteousness. You shall observe God, and know that you will meet Him. Give good news to the believers. ",
    
    "Anyone of you attending the Friday (prayers) should take a bath.",
    "The taking of a bath on Friday is compulsory for every male (Muslim) who has attained the age of puberty.",
  
    
    "I saw Jabir bin Abdullah praying in a single garment and he said that he had seen the Prophet praying in a single garment ",
    "The Prophet prayed in one garment and crossed its ends.",
    "I saw the Prophet offering prayers in a single garment in the house of Um-Salama and he had crossed its ends around his shoulders.",
    "The Prophet said, 'When I stand for prayer, I intend to prolong it but on hearing the cries of a child, I cut it short, as I dislike to trouble the child's mother.' ",
    "If your women ask permission to go to the mosque at night, allow them.",
    "Any one of you women who wants to go out to the Masjid should not go near any perfume",
    
    "He commanded us (women) to bring out the menstruating women and the virgins for both the Eid prayers, and that the Friday prayer is not obligatory on us (women)",
    
    "The believing women used to perform the Subh prayer with the Prophet, then they would go back to their families and no one would recognize them",
    "Had Allah's Messenger known what the women were doing, he would have forbidden them from going to the mosque as the women of Bani Israel had been forbidden."
   
]